{
  "About": {
    "EN": {
      "AboutTitle": "About this Guide",
      "Question1": "Why is data important in the context of public consultation?",
      "Answer1": "<p>Imagine that you have just completed a public consultation event. You published an online survey and received over 1000 responses from Canadian citizens. You are now faced with a large and complex spreadsheet of survey responses and need to create a report and present actionable recommendations. How do you get there? How do you demonstrate to citizens that you effectively managed and analyzed their responses?</p><p>The responses and feedback that you collect from citizens during public consultations is valuable data that needs to be effectively managed so that it can inform decision-making. While there are many important activities that go into planning and executing a public consultation event (whether it be online or in person), the work does not stop once the event is complete. You may end up with large volumes of citizen feedback (data) in a variety of structured and unstructured formats. In its “raw” form, this data may contain errors and not immediately reveal any insight into the perspectives of citizens. By building a strong foundation in data literacy, you will be better able to translate this complex data into actionable knowledge, leading to more informed decision-making.</p><p>Through documentation of process and transparent analysis, effective data management during public consultation processes can also help you more clearly inform citizens how their feedback is integrated into policy-decisions.</p>",
      "Question2": "What is the aim of this guide?",
      "Answer2": "<p>This data literacy guide is intended to promote data literacy for Government of Canada employees who are involved in planning, implementing, and evaluating public engagement processes. While this guide addresses many generalizable concepts, such as the difference between quantitative and qualitative data, all content is tailored to the context of public consultation activities.</p><p>It is expected that users of this guide will have prior experience with public engagement and public consultation. Users are not required to have any prior experience working with data.</p> ",
      "Question3": "What is data literacy?",
      "Answer3": "<p>Data literacy refers to 'the ability to read, work with, analyze, and argue with data'.</p><ul><li>'Reading data' means that you understand what data is and what elements of the real world it represents.</li><li>'Working with data' involves tasks such as collecting, storing, cleaning, and managing data.</li><li>Analysis may include activities such as filtering, comparing, sorting, and summarizing data.</li><li>'Arguing with data' means that you can use data to support a greater narrative and purpose.</li></ul><p><i>Source: Bhargava, R., & D’Ignazio, C. (2015, June). Designing tools and activities for data literacy learners. In Workshop on Data Literacy, Webscience.</i></p><p>Within the broad context of public engagement, data literacy also requires an understanding of how processes of data management can be integrated into the complex environment of government decision-making and policy development. </p>",
      "Question4": "How should I navigate through this guide?",
      "Answer4": "<p><u>Where to begin:</u></p><p>The educational material in this guide is broken down into a series of learning modules. Before jumping into the learning modules, start by taking a look at the Learning Modules Overview page. This overview will help you understand how the modules are related to each other and link together to form a workflow for processing public consultation data.</p><p>You should then begin with the first learning module (What is Public Consultation Data?). Even if you consider yourself to have an advanced level of data literacy, all users of this guide should begin with the first learning module as certain terms are introduced in this module that will be referenced in subsequent modules.</p><p><u>How to engage with each module:</u></p><p>Each learning module is broken down into subsections. You can navigate through these subsections by clicking on different tabs within the module page. The last subsection of each module is a “Check Your Understanding” quiz, which contains several multiple choice questions. The key vocabulary introduced in each module is listed at the bottom of each module page. You can click on each term to reveal its definition.</p><p>Throughout the subsections of each module, both static and interactive content is presented. Try clicking on the buttons to reveal additional information or highlight relevant content on the page.</p><p>A variety of datasets are also presented to demonstrate key concepts. You can scroll through these datasets (both vertically and horizontally) to reveal more data. Most of these datasets are real public consultation datasets published by the Government of Canada, found on open.canada.ca (some real datasets may have undergone some basic cleaning to be suitable for this web format).</p>",
      "Question5": "What are the learning objectives of the modules in this guide?",
      "Answer5": "<p>The learning objectives of this guide can be broken down according to the subsections in each module. The learning objectives for Modules 1 and 2 are as follows:</p><p><i>Module 1: What is public consultation data?</i></p>Section 1: Consultation Results as Data<ul><li>Users recognize public consultation as a data collection exercise, where citizen responses are considered as data that must be managed and analyzed to make effective decisions.</li><li>Users are able to identify the different types of data that may be collected during a public consultation, both in terms of content and format.</li></ul>Section 2: What is Data<ul><li>Users are able to identify the differences between data, information, and knowledge.</li><li>Users are able to adequately distinguish between types quantitative data and qualitative data.</li><li>Users are able to define metadata and identify the metadata present in a public consultation dataset.</li></ul>Section 3: Investigating a Dataset<ul><li>Users apply their knowledge on types of data to an example dataset.</li><li>Users can identify the characteristics of a standard tabular data structure.</li></ul>Check Your Understanding: Quiz<ul><li>Users are able to apply their knowledge and check their understanding of the content presented in the previous sections.</li></ul><p><i>Module 2: Data Preprocessing</i></p>Section 1: Preprocessing Techniques<ul><li>Users recognize the importance of data preprocessing and its impact on the quality of data analysis.</li><li>Users are able to differentiate between the three basic categories of preprocessing activities (data cleaning, integration, transformation). Users are able to classify activities according to these categories. </li></ul>Section 2: Getting to Know a Dataset<ul><li>Users are able to critically examine an example dataset and predict potential preprocessing needs.</li></ul>Section 3: Examples of Preprocessing Needs in Federal Datasets<ul><li>Users are able to apply their knowledge from the previous section to perform basic preprocessing activities to real-world datasets from the Government of Canada.</li></ul>Check Your Understanding: Quiz<ul><li>Users are able to apply their knowledge and check their understanding of the content presented in the previous sections.</li></ul>",
      "Question6": "Where can I find resources for further learning?",
      "Answer6": "Please visit this link to find a post with further resources."
    }, 
    "FR": {
    "AboutTitle": "",
    "Question1": "",
    "Answer1": "",
    "Question2": "",
    "Answer2": "",
    "Question3": "",
    "Answer3": "",
    "Question4": "",
    "Answer4": "",
    "Question5": "",
    "Answer5": "",
    "Question6": "",
    "Answer6": ""
    }
  } 
}