{
  "Module1": {
    "EN": {
      "M1Title": "Module 1: What is Public Consultation Data?",
      "M1S1Tab": "Section 1",
      "M1S1Title": "Consultation Results as Data",
      "M1S1Text1": "<p>Imagine that you have consulted Canadians across the country on the visitor fees for National Parks. These visitor fees were last adjusted in 2008, and you believed that it was time to engage citizens in conversations on this topic. You want to understand how citizens feel about fee adjustments, and the desire that citizens have for value-added services, such as guided tours and recreational facilities. You have used multiple approaches to consult with citizens on this topic:</p><p>1. You have held 15 town hall meetings in communities across the country. Citizens attended these meetings in person to learn more about fee structures at Canada’s National Parks and share their opinions with you and other members of your team. During each of these meetings, members of your team took notes on the key topics that were discussed.</p><p>2. You created an online questionnaire that was distributed to citizens across the country. This form contained several multiple choice questions and several freeform text questions. You collected 3305 responses to this questionnaire, which were then exported to a spreadsheet.</p><p>3. Members of your team conducted 24 telephone interviews with key stakeholders and civil society representatives. These telephone interviews were recorded and transcribed.</p><p>You now have lots of feedback from Canadians. This is all valuable data! You will use it to inform the decisions that you make about visitor fees for National Parks.</p><p>Let's review the types of data that you have collected:</p>",
      "M1S1Button1": "Handwritten Notes",
      "M1S1Button1Title": "Handwritten Notes",
      "M1S1Button1Text": "You have 47 pages of notes taken by your colleagues during the town hall meetings. Your colleagues transcribed some key quotes, summarized key points, and noted the names of citizens who participated.",
      "M1S1Button2": "Spreadsheet",
      "M1S1Button2Title": "Spreadsheet",
      "M1S1Button2Text": "You have an Excel file (.XLSX) with 3305 responses to the online form that you sent to citizens. Each response contains responses to multiple choice questions and freeform text responses. Each response also contains the gender of the respondent, the date of form submission, and a unique ID number.",
      "M1S1Button3": "Transcript",
      "M1S1Button3Title": "Transcript",
      "M1S1Button3Text": "You have transcripts from 24 telephone interviews with representatives from neighbourhood associations. Each transcript is in a word document (.DOCX) format. Each interview was approximately 1 hour long.",
      "M1S1Text2": "Now that you have collected all this data, what do you do with it?",    
      "M1S2Tab": "Section 2",
      "M1S2Title": "What is Data?",
      "M1S2Text1": "<p>The data collected during your public consultation is an attempt to capture the needs and opinions of citizens and other stakeholders. This data is thus a valuable resource that can be used to inform your decision-making. In its raw form, however, this data is not immediately useful.</p><p>This data may be messy, unstructured, and disorganized. You need to preprocess and analyze the data to generate new information. You then need to interpret this information to generate knowledge about the needs and wants of the community members that you have consulted. It is this knowledge, not the raw data itself, that will help you determine how to best revise the visitor fee structure.</p><p>Before we get into the analysis and interpretation, let’s understand a bit more about some basic ways of classifying different types of data. These distinctions help us determine what kinds of analysis we can perform and what kinds of questions we can answer with our data.</p>",     
      "M1S2Card1Title": "Qualitative Data",
      "M1S2Card1Text": "<p>Qualitative data is used to describe the qualities of real-world objects or entities. Qualitative data is often descriptive and may be retrieved from documents in different formats, such as text or audio.</p><p><i>Eg. hair colour, socio-economic status</i></p>",
      "M1S2Card1Button": "See more",
      "M1S2Card1Sub1Title": "Nominal",
      "M1S2Card1Sub1Text": "<p>Nominal data does not have a natural ranking or order.</p><p><i>Eg. hair colour</i></p>",
      "M1S2Card1Sub2Title": "Ordinal",
      "M1S2Card1Sub2Text": "<p>Ordinal data has a natural ranking or order. Note that this distance between each item cannot be measured.</p><p><i>Eg. socio-economic status</i></p>",
      "M1S2Card2Title": "Quantitative Data",
      "M1S2Card2Text": "<p>Quantitative data is used to capture quantities of objects or entities. Quantitative data is numerical and reflects properties that can be measured.</p><p><i>Eg. temperature, number of children</i></p>",
      "M1S2Card2Button": "See more",
      "M1S2Card2Sub1Title": "Discrete",
      "M1S2Card2Sub1Text": "<p>Discrete data only contains certain allowable values.</p><p><i>Eg. number of children</i></p>",
      "M1S2Card2Sub2Title": "Continuous",
      "M1S2Card2Sub2Text": "<p>Any value within a given interval is a possible data point (depending on the measuring device).</p><p><i>Eg. temperature</i></p>",
      "M1S2Card3Title": "Metadata",
      "M1S2Card3Text": "<p>Metadata describes the characteristics of data.</p><p><i>Eg. data collection method, date of data collection, author</i></p>",
      "M1S2Text2": "Note that the quantitative and qualitative classifications are mutually exclusive. Data cannot be both quantitative and qualitative. There can, however, be both quantitative and qualitative types of data within a single dataset. Metadata can also be either quantitative or qualitative.",
      "M1S3Tab": "Section 3",
      "M1S3Title": "Introduction to Components of a Tabular Dataset",
      "M1S3Text1": "Let’s explore a subset of the spreadsheet of feedback that you collected from the online form that you sent around to Canadian citizens during your consultation. Go ahead and click on the buttons at the bottom of the page to highlight some of the different data types.",
      "M1S3Text2": "<p>How to explore this table:</p><ul><li>Scroll vertically and horizontally to view all the data</li><li>Hover your mouse over a cell to see all the content</li><li>Resize the width of columns by dragging to view more or less content</li><li>Visit <a href=\"https://docs.google.com/spreadsheets/d/1g2YP_1Yixk-GwVQgk4ni5YF5t6ivJXpUoxi2TFWjqKc/edit?usp=sharing\">this</a> link to view the dataset on Google Sheets</li><ul>",
      "M1S3Button1": "Quantitative: Discrete",
      "M1S3Button2": "Quantitative: Continuous",
      "M1S3Button3": "Qualitative: Nominal",
      "M1S3Button4": "Qualitative: Ordinal",
      "M1S3Button5": "Metadata",
      "M1S3Text3": "<p>It is important to note the structure of how data is stored in this table. The data is organized in rows and columns. Each column contains a single variable, or data type. The column labels, or headers, are stored in the first row of the table. Each row contains a single data entry, indicating that all the data in that row corresponds to the same real-world entity.</p><p>This is a standard structure for tabular datasets and may be required for the data to be read by analysis software. In most cases, consultation datasets should follow this format.</p>",
      "M1S4Tab": "Check Your Understanding",
      "M1S4Title": "Check Your Understanding: Quiz",
      "M1S4Text1": "The multiple choice questions will be based on the following content, collected as part of Natural Resources Canada’s Generation Energy consultation. This content was collected from an online forum located on the Generation Energy website.",
      "M1S4Text2": "<p>How to explore this table:</p><ul><li>Scroll vertically and horizontally to view all the data</li><li>Hover your mouse over a cell to see all the content</li><li>Resize the width of columns by dragging to view more or less content</li><li>Visit <a href=\"https://docs.google.com/spreadsheets/d/15qbQkl6nsAUREbkykQq1MZetjjvk8JebKyzlr5JFnyU/edit?usp=sharing\">this</a> link to view the dataset on Google Sheets</li><ul>",
      "M1S4Button": "Submit Quiz",
      "M1Vocabulary": "Key Vocabulary from this Module",
      "M1Vocab1": "Public consultation data",
      "M1Vocab1Def": "Public consultation data is the comments or feedback that you collect from citizens during a public consultation. Public consultation data can come in many different formats, such as handwritten notes, spreadsheets, or audio recordings.",
      "M1Vocab2": "Quantitative data",
      "M1Vocab2Def": "Quantitative data captures quantities of objects or entities. Quantitative data is numerical and reflects properties that can be measured. Includes discrete data, which only contains certain allowable values, and continuous data, in which any value within a given interval is a possible data point.",
      "M1Vocab3": "Qualitative data",
      "M1Vocab3Def": "Qualitative data describes the qualities of real-world objects or entities. Qualitative data is often descriptive and may be retrieved from documents in different formats, such as text or audio. Includes nominal data, which does not have a natural order or ranking, and ordinal data, which does have a natural order.",
      "M1Vocab4": "Metadata",
      "M1Vocab4Def": "Metadata is data that describes the characteristics of an associated dataset.", 
      "M1PrevButton": "Previous", 
      "M1NextModule": "Next Module"
    },
    "FR": {
      "M1Title": "",
      "M1S1Tab": "",
      "M1S1Title": "",
      "M1S1Text1": "",
      "M1S1Button1": "",
      "M1S1Button1Title": "",
      "M1S1Button1Text": "",
      "M1S1Button2": "",
      "M1S1Button2Title": "",
      "M1S1Button2Text": "",
      "M1S1Button3": "",
      "M1S1Button3Title": "",
      "M1S1Button3Text": "",
      "M1S1Text2": "",
      "M1S2Tab": "",
      "M1S2Title": "",
      "M1S2Text1": "",
      "M1S2Card1Title": "",
      "M1S2Card1Text": "",
      "M1S2Card1Button": "",
      "M1S2Card1Sub1Title": "",
      "M1S2Card1Sub1Text": "",
      "M1S2Card1Sub2Title": "",
      "M1S2Card1Sub2Text": "",
      "M1S2Card2Title": "",
      "M1S2Card2Text": "",
      "M1S2Card2Button": "",
      "M1S2Card2Sub1Title": "",
      "M1S2Card2Sub1Text": "",
      "M1S2Card2Sub2Title": "",
      "M1S2Card2Sub2Text": "",
      "M1S2Card3Title": "",
      "M1S2Card3Text": "",
      "M1S2Text2": "",
      "M1S3Tab": "",
      "M1S3Title": "",
      "M1S3Text1": "",
      "M1S3Button1": "",
      "M1S3Button2": "",
      "M1S3Button3": "",
      "M1S3Button4": "",
      "M1S3Button5": "",
      "M1S3Text2": "",
      "M1S4Tab": "",
      "M1S4Title": "",
      "M1S4Text1": "",
      "M1S4Button": "",
      "M1Vocabulary": "",
      "M1Vocab1": "",
      "M1Vocab1Def": "",
      "M1Vocab2": "",
      "M1Vocab2Def": "",
      "M1Vocab3": "",
      "M1Vocab3Def": "",
      "M1Vocab4": "",
      "M1Vocab4Def": "", 
      "M1PrevButton": "", 
      "M1NextModule": ""
    }
  }
}