{
  "Module2": {
    "EN": {
      "M2Title": "Module 2: Data Preprocessing",
      "M2S1Tab": "Section 1",
      "M2S1Title": "Data Preprocessing Techniques",
      "M2S1Text1": "<p>Data preprocessing is an important step to prepare your data for analysis. Many “raw” datasets contain errors, unecessary information, incomplete entries, and may not be structured or organized in the way that you would like. Effective preprocessing will improve the quality of your data, thus improving the quality of your data analysis and allowing you to obtain more accurate and useful knowledge from your data.</p><p>Specific preprocessing activities will depend on the characteristics of your dataset, your intended data analysis approach, and the overarching aims of your analysis. Nevertheless, the following is a list of three categories of common preprocessing activities:</p>",
      "M2S1Button1": "Data Cleaning",
      "M2S1Button1Title": "Data Cleaning",
      "M2S1Button1Text": "<p>Processes of data cleaning involve identifying and removing data entries with obvious errors or inaccuracies. Errors in your dataset may be identified programmatically or by manual review. Unwanted data entries may include the following:</p><ul><li>Duplicates: When one entry exactly matches another</li><li>Unrealistic values: Such as an age of 0</li><li>Incomplete: When the entry is missing one or more important fields</li><li>Irrelevant: Data that is not relevant to the task or question at hand</li></ul><p>When cleaning your data, be careful not to remove entries just because they aren’t what you expected. Doing so can introduce bias into your dataset and cause you to lose valuable information. Specific data cleaning activities will depend on the characteristics of your dataset.</p>",
      "M2S1Button2": "Data Integration",
      "M2S1Button2Title": "Data Integration",
      "M2S1Button2Text": "<p>Data integration is the process of combining data from multiple sources. Different integration techniques may be employed, depending on the content and structure of the datasets that you are combining. Consider the following examples:</p><p>1. You have two spreadsheets of responses to the same online form. One spreadsheet is a set of responses from 2016, and the other is from 2017. As the columns in both spreadsheets match up, your process of integrating these two datasets into a single spreadsheet is simple. You can copy all the responses from the 2016 spreadsheet and paste them directly into the 2017 spreadsheet.</p><p>2. You have a list of participants at a town hall meeting that includes first name, last name, and profession. You have a seperate spreadsheet with the results to a digital polling exercise conducted during the meeting, containing last name and polling response. You are able to join these two datasets by matching entries according to the participant’s last name.</p>",
      "M2S1Button3": "Data Transformation",
      "M2S1Button3Title": "Data Transformation",
      "M2S1Button3Text": "<p>Data transformation involves manipulating data into another format that is more appropriate for the eventual analysis.</p><p>Imagine that you wanted to determine the most frequently occurring words in a set of responses to a consultation question. You need to transform your text in several ways so that a computer can accurately calculate the number of times that each word occurs:</p><ul><li>Convert all letters to lowercase (so that “Cat” and “cat” will be identified as the same word)</li><li>Remove punctuation (you don’t care about how many “.”’s there are)</li><li>Remove commonly used, but meaningless, words such as “a”, “the”, and “and”</li></ul>",
      "M2S1Text2": "No matter what kind of preprocessing you do, it is important to DOCUMENT every step that you take. Clearly documenting your preprocessing procedure will help others replicate your analysis, interpret your results, and understand potential limitations and biases.",
      "M2S2Tab": "Section 2",
      "M2S2Title": "Getting to Know a Dataset",
      "M2S2Text1": "Imagine that you are interested in the following question:",
      "M2S2Text2": "What are Canadians’ expections regarding privacy in both the physical and digital worlds? Do expectations of privacy differ across these two environments?",
      "M2S2Text3": "To help answer this question, you have downloaded a dataset that was collected as part of the Government of Canada’s consultation on national security. Let’s begin by exploring this dataset and asking some basic questions:",
      "M2S2Text4": "<p>How to explore this table:</p><ul><li>Scroll vertically and horizontally to view all the data</li><li>Hover your mouse over a cell to see all the content</li><li>Visit <a href=\"https://docs.google.com/spreadsheets/d/1t6TazxBp5GVKBiHLgmXPWOnbmdFOC204-WSkXDDwWsY/edit?usp=sharing\">this</a> link to view the dataset on Google Sheets</li><ul>",
      "M2S2Text5": "Click on the buttons below to reveal some key questions to ask while exploring your dataset, important attributes of the dataset to consider when determining your preprocessing approach, and potential preprocessing options",
      "M2S2Button1": "Exploring your dataset",
      "M2S2Button1Title": "Exploring your dataset",
      "M2S2Button1Text": "<ul><li>Where does this data come from? How was this data collected? (you may need to visit the \"Download\" link and look for relevant metadata)</li><li>What data do I need to address my policy question?</li><li>Are there any errors in this dataset that are readily apparent?</li><li>Do I have enough data? Too much data?</li><li>How might I analyze this data to answer my policy question?</li></ul>",
      "M2S2Button2": "Preprocessing considerations",
      "M2S2Button2Title": "Preprocessing considerations",
      "M2S2Button2Text": "<ul><li>This dataset contains 3307 entries. Think about what tasks can be done manually and what should be automated. For example, imagine that you have to change the date/time format. Do you want to manually reformat the date/time in each entry or do you want to create a formula in Excel (or another software tool) to do it all at once?</li><li>This dataset contains entries in both French and English.</li><li>This dataset contains responses to many questions, not all of which are relevant to the question that you are trying to address.</li><li>Some of the entries in this dataset are missing responses to certain questions.</li><li>Some entries in this dataset are duplicates (how can you identify duplicates)?</li></ul>",
      "M2S2Button3": "Potential preprocessing options",
      "M2S2Button3Title": "Potential preprocessing options",
      "M2S2Button3Text": "<ul><li>Identify and remove any duplicate data entries</li><li>Separate French and English entries</li><li>Remove unnecessary fields (eg. those containing responses to irrelevant questions)</li><li>Remove entries that do not contain answers to the relevant consultation question</li><li>Convert from .XLSX to .CSV (depending on the software that will be used for analysis</li></ul>",
      "M2S2Text6": "Feel free to download the data yourself for further exploration and to experiment with basic preprocessing. (Download the dataset that was received via online consultation portal from 05/11/2016-15/12/2016)",
      "M2S2Button4": "Download",
      "M2S3Tab": "Section 3",
      "M2S3Title": "Examples of Preprocessing Needs in Federal Datasets",
      "M2S3Text1": "<p>Now that you have learned about basic preprocessing techniques and have practiced exploring a dataset, let’s take a look at some consultation datasets from the Government of Canada that might need preprocessing.</p><p>For each of the following examples, a specific preprocessing need will be highlighted. You can then download the dataset yourself or access a copy via Google Sheets. Once you have the dataset in front of you, follow the instructions presented in the example to try to address the preprocessing need.</p>",
      "M2S3Card1Text": "<p>LEVEL 1: Modernization of federal labour standards survey</p><p>The field headers in this dataset are in two different rows. This structural issue may cause errors when attempting to analyze the data. Try to correct this structural issue.</p><p>(Download either the French or the English version)</p>",
      "M2S3Card1Button1": "Download",
      "M2S3Card1Button2": "Google Sheets",
      "M2S3Card2Text": "<p>LEVEL 2: Generation energy idea and comment submissions</p><p>This dataset contains both ideas and comments (in response to ideas) from consultation participants. Each idea is scored, and comes from a certain user category. For your analysis, you are only interested in ideas from “small business” users with a score of greater than 0. Select the appropriate subset from this dataset.</p><p>(Download the \"Generation Energy Submissions\" dataset in CSV format)</p>",
      "M2S3Card2Button1": "Download",
      "M2S3Card2Button2": "Google Sheets",
      "M2S3Card3Text": "<p>LEVEL 3: Third biennial plan to Open Government Partnership online survey</p><p>Imagine that you are interested in the respondents’ preferred way(s) to participate in Open Government. This dataset contains responses to a survey question on that topic, whereby respondents selected from multiple predefined options (coded as an integer). The responses to this question may contain multiple options within a single cell. This structure of data storage means that it is difficult to count the total number of times that each option was selected by respondents. Try to restructure the way that this data is stored so that a single cell contains a maximum of one integer. You will have to increase the number of columns that are used to store this data. *Note: you may also want to take a look at the metadata (Release Notes) for this dataset to give you some context for the coded integer values.</p><p>(Download the \"Individual Comments\" dataset in CSV or XLS format)</p>",
      "M2S3Card3Button1": "Download",
      "M2S3Card3Button2": "Google Sheets",
      "M2S4Tab": "Check Your Understanding",
      "M2S4Title": "Check Your Understanding: Quiz",
      "M2S4Text1": "The multiple choice questions will be based on the following dataset, collected as part of the Government of Canada’s National Security Consultation. This dataset contains a collection of email responses. You may want to visit this link and take a look at the documentation (available for PDF download) to help you answer the following questions.",
      "M2S4Text2": "<p>How to explore this table:</p><ul><li>Scroll vertically and horizontally to view all the data</li><li>Hover your mouse over a cell to see all the content</li><li>Visit <a href=\"https://docs.google.com/spreadsheets/d/1NrGZoDzdAhxoL7rruI8J17B4xSRcnEXsNBU2Zcx7nT0/edit?usp=sharing\">this</a> link to view the dataset on Google Sheets</li><ul>",
      "M2S4Button1": "Submit Quiz",
      "M2S4Button2": "Check your answers",
      "M2S4Answers": "<p>1. B is correct.</p><p>Deleting angry comments and fixing spelling errors is inappropriate as you would be changing the meaning of the data.</p><p>2. A is correct.</p><p>As this dataset was published online, the data in the fields “FromName” and “FromAddress” have been removed and replaced with “*”. The act of publishing this dataset online (option B) would not be considered preprocessing as it does not, in itself, change anything about the dataset. Entries are duplicated (option C) during the data collection process and are not the result of any preprocessing on the dataset. </p><p>3. B is correct.</p><p>In many cases, duplicated entries (rows in the dataset) are a result of errors during data entry processes. For example, someone might fill out a form online and accidentally click the button to submit the form twice. These kinds of duplicates would be appropriate to remove during preprocessing as they were not intentional and came from the same person. In this case, however, one can imagine that the duplicate responses are the result of a targeted email campaign across a community, which is a significant event that should be considered during the data analysis.</p>",  
      "M2Vocabulary": "Key Vocabulary from this Module",
      "M2Vocab1": "Preprocessing",
      "M2Vocab1Def": "Data preprocessing includes activities to prepare a dataset for analysis. Preprocessing activities can include data cleaning, data transformation, and data integration.",
      "M2Vocab2": "Data quality",
      "M2Vocab2Def": "<p>Data quality refers to the extent to which a dataset is fit for its intended purpose.</p><p>Source: Wang, R. Y., & Strong, D. M. (1996). Beyond accuracy: What data quality means to data consumers. Journal of management information systems, 12(4), 5-33.</p>", 
      "M2PrevModule": "Previous Module"
    },
    "FR": {
      "M2Title": "",
      "M2S1Tab": "",
      "M2S1Title": "",
      "M2S1Text1": "",
      "M2S1Button1": "",
      "M2S1Button1Title": "",
      "M2S1Button1Text": "",
      "M2S1Button2": "",
      "M2S1Button2Title": "",
      "M2S1Button2Text": "",
      "M2S1Button3": "",
      "M2S1Button3Title": "",
      "M2S1Button3Text": "",
      "M2S1Text2": "",
      "M2S2Tab": "",
      "M2S2Title": "",
      "M2S2Text1": "",
      "M2S2Text2": "",
      "M2S2Text3": "",
      "M2S2Text4": "",
      "M2S2Text5": "",
      "M2S2Button1": "",
      "M2S2Button1Title": "",
      "M2S2Button1Text": "",
      "M2S2Button2": "",
      "M2S2Button2Title": "",
      "M2S2Button2Text": "",
      "M2S2Button3": "",
      "M2S2Button3Title": "",
      "M2S2Button3Text": "",
      "M2S2Text6": "",
      "M2S2Button4": "",
      "M2S3Tab": "",
      "M2S3Title": "",
      "M2S3Text1": "",
      "M2S3Card1Text": "",
      "M2S3Card1Button1": "",
      "M2S3Card1Button2": "",
      "M2S3Card2Text": "",
      "M2S3Card2Button1": "",
      "M2S3Card2Button2": "",
      "M2S3Card3Text": "",
      "M2S3Card3Button1": "",
      "M2S3Card3Button2": "",
      "M2S4Tab": "",
      "M2S4Title": "",
      "M2S4Text1": "",
      "M1S4Text2": "",
      "M2S4Button1": "",
      "M2S4Button2": "",
      "M2S4Answers": "",
      "M2Vocabulary": "",
      "M2Vocab1": "",
      "M2Vocab1Def": "",
      "M2Vocab2": "",
      "M2Vocab2Def": "", 
      "M2PrevModule": ""
    }
  }
}