[
  {
    "a": "#",
    "b": "Date",
    "c": "Language/Langue",
    "d": "Should existing review bodies – CRCC, OCSEC and SIRC – have greater capacity to review and investigate complaints against their respective agencies?/\nEst-ce que les organismes d’examen actuels – la CCETP, le BCCST et le CSARS – devraient avoir une plus grande capacit%u017D d’examiner les activit%u017Ds des organismes qui relèvent d’eux et de faire enquête sur les plaintes d%u017Dpos%u017Des contre ces organismes?",
    "e": "Should the existing review bodies be permitted to collaborate on reviews?\nEst-ce que les organismes d’examen existants devraient être autoris%u017Ds %u02C6 collaborer %u02C6 la r%u017Dalisation de ces examens?",
    "f": "Should the Government introduce independent review mechanisms of other departments and agencies that have national security responsibilities, such as the CBSA?/\nDevrait-il y avoir des m%u017Dcanismes d’examen ind%u017Dpendant d’autres ministères ou organismes qui ont des responsabilit%u017Ds li%u017Des %u02C6 la s%u017Dcurit%u017D nationale, comme l’ASFC?",
    "g": "The proposed committee of parliamentarians will have a broad mandate to examine the national security and intelligence activities of all departments and agencies. In light of this, is there a need for an independent review body to look at national security activities across government, as Commissioner O'Connor recommended?/ Le comit%u017D propos%u017D de parlementaires aura un vaste mandat d’examiner les activit%u017Ds li%u017Des %u02C6 la s%u017Dcurit%u017D nationale et au renseignement de tous les ministères et organismes. En plus de cela, est-il n%u017Dcessaire de cr%u017Der un organe d’examen ind%u017Dpendant qui pourrait examiner les activit%u017Ds li%u017Des %u02C6 la s%u017Dcurit%u017D nationale men%u017Des %u02C6 travers le gouvernement, comme l’a recommand%u017D le Commissaire O’Connor dans son rapport?",
    "h": "The Government has made a commitment to require a statutory review of the ATA, 2015 after three years. Are other measures needed to increase parliamentary accountability for this legislation?/\nLe gouvernement s’est engag%u017D %u02C6 exiger un examen l%u017Dgislatif de la Loi antiterroriste de 2015 après trois ans. À votre avis, d’autres mesures sont-elles n%u017Dcessaires pour assurer une meilleure responsabilisation parlementaire relativement %u02C6 cette loi?",
    "i": "Name/Nom",
    "j": "Affiliation",
    "k": "Region/R%u017Dgion",
    "l": "Self-Identification/Auto-identification"
  },
  {
    "a": 465,
    "b": "2016-11-04 21:21",
    "c": "EN",
    "d": "yes",
    "e": "yes",
    "f": "yes",
    "g": "yes",
    "h": "yes",
    "i": "",
    "j": "",
    "k": "",
    "l": "Private sector"
  },
  {
    "a": 466,
    "b": "2016-11-04 21:22",
    "c": "EN",
    "d": "yes",
    "e": "yes",
    "f": "yes",
    "g": "yes",
    "h": "yes",
    "i": "",
    "j": "",
    "k": "",
    "l": ""
  },
  {
    "a": 467,
    "b": "2016-11-04 21:22",
    "c": "EN",
    "d": "yes",
    "e": "yes",
    "f": "yes",
    "g": "yes",
    "h": "yes",
    "i": "",
    "j": "",
    "k": "",
    "l": ""
  },
  {
    "a": 468,
    "b": "2016-11-05 2:01",
    "c": "EN",
    "d": "Absolutely and the information that they are reviewing should be less redacted and more open so that their reviews can be  adequately carried out.",
    "e": "Yes  on the ACT should encourage this.",
    "f": "Yes for all  security agencies but CBSA is a special case with a history of problems and a mandate that includes holding human detainees that must have its own independent reviewing authority.",
    "g": "Yes",
    "h": "Yes.",
    "i": "*",
    "j": "",
    "k": "Ontario",
    "l": "Engaged citizen"
  },
  {
    "a": 469,
    "b": "2016-11-05 16:20",
    "c": "EN",
    "d": "Recently, we experienced three major difficulties in the oversight actions of government officials:  RCMP - abuse of both male and female within the ranks and the First Nations youth incarcerated in isolation with lights on 24/7 for years.  These events do not give me confidence that much of anything in terms of oversight is happening.  One received an apology and a commitment to do better (female RCMP abuse) one I don't know of anything happening yet (male RCMP abuse) and the young 1st Nations man whose situation was not addressed until 13 more days had passed because an official did not want to interfere with the department.  That is his job to interfere when events go off the rails.   \nI believe education up and down from the Minister to every staff member in every department is a fundamental requirement.  Next options for whistle blowers to come forward anonymously if necessary to keep off the rail events from dragging on for years.  Yes, anonymous means there will be false claims, but currently legitimate claims are often treated as false to maintain status quo.  This is akin to abolishing the death penalty so no one dies who is innocent, this is the same, all concerns treated as legitimate until proven false.   It is sheer arrogance for upper echelon leaders to think they know what is happening throughout their departments.  There needs to be an egalitarian communication system in place so real events are communicated and rectified.  When the topic impacted is our national security YIKES let's get this fixed.  Who knows how many taken for granted messes are haplessly confounding our national security because it is the way things have always been done.",
    "e": "I think multiple perspectives are always needed.  However, there is a difference in offering an opinion compared to being on the one who makes the decision.  I always have concerns with bureaucracies policing themselves.  Payback, promotions, requests made for assignment changes whether context or location, respectful communications with everyone are all at risk due to unsupervised and unaccountable power that individuals either are given by the system or acquire by being condoned bullies within the system.  \nWhen it is our national security that is the focus, these thwarting actions cannot be allowed to be present.   I think creative, intelligent, MORAL, outsiders who have nothing to gain or lose, are critical people to have on any review body.",
    "f": "Every department that has anything to do with national security should be under regular review.  Internal best practices need to be scrutinized to make sure whistle blowers have a means to communicate concerns about anything:   processes, outcomes, communications whatever is seen as a concern.  \nA hand written suggestion box although old fashioned is also effective in keeping minutia as well as major ideas flowing.  It is one way to make sure the processes that are happening are synchronized with what the public is being told is happening and with the best interests of our national security.  These suggestion boxes need to be opened by the group that has nothing to gain or lose, not by someone within the department who will scrutinize within their own departmental baggage lens.",
    "g": "Yes.  Our parliamentarians are so often party driven rather than people driven.  If we had a parliament of independent MPs it may work.  However, whenever vested interests, paybacks etc., could trump Canadian priorities and the priorities of Canadians, we need to have an independent body of highly moral, educated, skilled, creative individuals examining as well as reviews by people with vested interests such as Party MPs.",
    "h": "Three years - wow a lot of damage is done in a very short time - look at the omnibus bills of the previous government that swash buckled through so many Canadian protection laws.  3 years is too long unless there are anonymous communication systems in place allowing daily scrutiny and unless there is an independent review body of individuals with absolutely NOTHING to gain from any decision made.  The independent review body needs to be the group that receives the daily communications about whatever.",
    "i": "*",
    "j": "",
    "k": "British Columbia",
    "l": "Engaged citizen"
  },
  {
    "a": 470,
    "b": "2016-11-05 22:40",
    "c": "EN",
    "d": "Yes, but only with oversight to ensure that effort is not duplicated, that national security issues are addressed with appropriate tools and vigour and that the existing review bodies have the investigative resources to carry out their responsibilities",
    "e": "Yes",
    "f": "Yes.  If what 9/11 should have taught, is that interagency turf-protection and other reasons for not exchanging data are dangerous and that such data must be circulated to all agencies with national security responsibilities.",
    "g": "That all depends on the composition of the committee of Parliamentarians. There is a danger with a parliamentary committee that certain issues become partisan ones and genuine concerns are not addressed properly.  An independent, non-partisan body could overcome this, but would need to be seen as a neutral arbiter.",
    "h": "Likely not.  One should avoid too-frequent statutory reviews as they tend to paralyze processes",
    "i": "*",
    "j": "*",
    "k": "Ontario",
    "l": "Engaged citizen"
  },
  {
    "a": 471,
    "b": "2016-11-06 11:30",
    "c": "EN",
    "d": "No an independent public body comprised of 75% randomly selected Canadians and 25% appointed needs to be struck that has the power to act when there are complaints. The bodies that self investigate are a vessel for corruption and public oversight that can only suggest are a joke as nothing binds these organizations to take action",
    "e": "No an independent public body comprised of 75% randomly selected Canadians and 25% appointed needs to be struck that has the power to act when there are complaints. The bodies that self investigate are a vessel for corruption and public oversight that can only suggest are a joke as nothing binds these organizations to take action",
    "f": "YES\nan independent public body comprised of 75% randomly selected Canadians and 25% appointed needs to be struck that has the power to act when there are complaints. The bodies that self investigate are a vessel for corruption and public oversight that can only suggest are a joke as nothing binds these organizations to take action. This is no different than elected officials people may say they need qualifications, the qualifications would be a moral standard reflective of Canadians",
    "g": "Yes but not review see below\n\nan independent public body comprised of 75% randomly selected Canadians and 25% appointed needs to be struck that has the power to act when there are complaints. The bodies that self investigate are a vessel for corruption and public oversight that can only suggest are a joke as nothing binds these organizations to take action",
    "h": "yes see below\nan independent public body comprised of 75% randomly selected Canadians and 25% appointed needs to be struck that has the power to act when there are complaints. The bodies that self investigate are a vessel for corruption and public oversight that can only suggest are a joke as nothing binds these organizations to take action",
    "i": "",
    "j": "",
    "k": "",
    "l": "Engaged citizen"
  },
  {
    "a": 472,
    "b": "2016-11-06 17:35",
    "c": "EN",
    "d": "Yes",
    "e": "No",
    "f": "Yes",
    "g": "Yes",
    "h": "Public vote",
    "i": "",
    "j": "",
    "k": "",
    "l": "Academic"
  },
  {
    "a": 473,
    "b": "2016-11-07 11:25",
    "c": "EN",
    "d": "no comment",
    "e": "yes",
    "f": "yes",
    "g": "yes",
    "h": "no comment",
    "i": "",
    "j": "",
    "k": "",
    "l": ""
  },
  {
    "a": 474,
    "b": "2016-11-07 12:37",
    "c": "EN",
    "d": "I believe it is absolutely necessary to have an independent review body capable of operating and providing oversight in real-time with unlimited access to CSE, CSIS, and RCMP activities.  The independent review body would need the expertise to objectively weigh the rights of Canadians against the need to secure Canadians from threats, both foreign and domestic.  If the body determines an agencies actions are in violation of a Canadian's constitutional or legal rights without merit, the independent body should have the power to shut down the investigation immediately.",
    "e": "Yes, I absolutely believe that the review bodies should be permitted to collaborate on reviews given that our security agencies collaborate in their activities as well.  This is an absolutely necessary step given the modern security response to threats of national security.",
    "f": "Yes, more formal independent review mechanisms with teeth need to be developed to oversee the activities of all security agencies operating in Canada.  Their authority and parameters must be made clear and they should be instructed to lean towards the protection and preservation of every Canadians constitutional rights whenever the need to violate said rights is uncertain.",
    "g": "Yes, I believe an independent review body is still necessary as I believe that parliamentarians neither have the time nor adequate expertise to oversee the activities of the security agencies in real-time and from an objective, informed standpoint.  Parliamentarians are often too beholden to constituents who can easily be swayed by fear to surrender their rights in exchange for protection, even where such aggressive security measures are not, in fact, warranted.",
    "h": "Both the Prime Minister and the Minister of Public Safety need to be held accountable for any unwarranted violation of a Canadian's constitutional rights to ensure that proper measures are put in place to ensure that security agencies are more cautious in the exercise of their powers.",
    "i": "*",
    "j": "",
    "k": "Ontario",
    "l": "Academic"
  },
  {
    "a": 475,
    "b": "2016-11-07 16:55",
    "c": "EN",
    "d": "Yes",
    "e": "Yes - why wouldn't they.  Stovepipes create gaps and possible duplication of effort.",
    "f": "Yes - as long as any new body also cooperates, coordinates with the existing ones.",
    "g": "Yes - keep the politics out of the review process.",
    "h": "no",
    "i": "",
    "j": "",
    "k": "",
    "l": "Engaged citizen"
  },
  {
    "a": 476,
    "b": "2016-11-08 7:49",
    "c": "EN",
    "d": "Yes as this is the only way to operate as transparently as possible.",
    "e": "Yes, this may save time, money and share information that the other agencies did not/could not obtain.",
    "f": "Possibly however if the review bodies become to prevalent and fine grain, no work will ever get done.",
    "g": "Yes",
    "h": "Yes, the review bodies themselves should be reviewed independently on occasion to ensure there is complete transparency of their members.",
    "i": "",
    "j": "",
    "k": "Ontario",
    "l": "Law enforcement"
  },
  {
    "a": 477,
    "b": "2016-11-08 13:12",
    "c": "EN",
    "d": "Yes. Independent non-partisan reviews.",
    "e": "No. They shouldn't collaborate but facts should passed between bodies. Facts should be available to the public.",
    "f": "Yes",
    "g": "Yes. I disagree with a parliamentarian reviewing others work. Reviewing can't be tied to other bodies.",
    "h": "Yes.",
    "i": "",
    "j": "None",
    "k": "British Columbia",
    "l": "Engaged citizen"
  },
  {
    "a": 478,
    "b": "2016-11-08 17:54",
    "c": "EN",
    "d": "Yes. All  of these agencies are hampered by bureaucratic red tape put in place by the very agencies they are to review. Too often the old catch phrase \"national security\" is used to block in depth reviews and essentially permit wrongdoing by agency members.",
    "e": "Only provided they do not have conflicting interests outside of the subject of review.",
    "f": "Yes. All agencies should have independent citizen review processes. Too often the review process is co-opted by those who have a vested interest in the outcome. Ordinary citizens must have a place on these review bodies. The method of selection should not be simply a list of who is who in the political world.",
    "g": "I like the idea of parliamentarians actually having such a mandate. The problem will be in who and how the parliamentarians are selected. Most loyal? Most connected? Least questioning?",
    "h": "",
    "i": "*",
    "j": "",
    "k": "Ontario",
    "l": "Engaged citizen"
  }
]