[
   {
      "﻿Post Number/ Numéro du poste": 1,
      "Date Posted/Dat": "21-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "affordable energy",
      "Idea or Comment Description": "Investing more money on research and development to make energy more affordable - and less on operations and top level salaries. If we can put men and women on the moon, this should be a piece of cake!",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "User Defined Tags": "Innovation; Energy Efficiency; Industry",
      "Thème deéfini par l'itilisateur": "Innovation; Efficacité énergétique; Industrie",
      "Forum Related Theme": "Innovation; Affordability",
      "Thème commun du Forum": "Innovation; Abordabilité",
      "Idea Score/Évaluations d'idée": 15,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 1,
      "Date Posted/Dat": "25-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "ralph Klein was a bell end for selling off transalta",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 1,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Put enough efforts, resources and commitment into seriously climate change and it will pay off. This might be hard for politicians to act short and long-term at the same time. But it does need to be done.",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 2,
      "Date Posted/Dat": "21-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Don't forget about small ",
      "Idea or Comment Description": "There are so many good ideas about clean and renewable energy, but we cannot forget about the many communities across Canada dependent on traditional energy, economically and socially. A transition away from fossil fuels in Canada needs to happen, but it cannot be overnight. I would be interested to hear ideas for transitioning local labour markets in a sustainable way so that working families can continue to support themselves in this transition.",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "User Defined Tags": "Fossil Fuels; Innovation; Industry; Climate Change",
      "Thème deéfini par l'itilisateur": "Combustibles fossiles; Innovation; Industrie; Chandements climatiques",
      "Forum Related Theme": "Petroleum; Labour Markets",
      "Thème commun du Forum": "Pétrolier; Marché du travail",
      "Idea Score/Évaluations d'idée": 34,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 2,
      "Date Posted/Dat": "24-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "I agree. I live in a small town about 70km outside of Ottawa and have limited options for energy use. Currently on electricity only, which costs almost as much as my mortgage. It's crazy! I would also be interested in hearing ideas about how I can help transition my family to more efficient and sustainable (and affordable!) energy usage.",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 2,
      "Date Posted/Dat": "24-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Agreed as well! While I live in Ottawa now, I grew up in a smaller community, and can empathize that not everyone desires living in a large city. The current structure of electricity delivery charges penalizes those who live in smaller, rural communities. It'd be great to see some reform on this! The idea of microgrids has been floated around a lot recently, but there's a need to analyze all the diverse data out there, and make a solid business case for these systems and how they may work in specific small communities in Canada (while looking at enviro, economic and social factors). ",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 2,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Energy transition \"can't not happen overnight\":  is does sound like an excuse for not really acting to address climate change. Show the Canadian leadership and act now!",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 2,
      "Date Posted/Dat": "28-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Local energy sources like biomass (firewood, wood pellets, wood chips etc.) will support the local economy by creating jobs and reduce our reliance on sources outside our respective Provinces.  ",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 2,
      "Date Posted/Dat": "03-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Anyone living in rural Canada should be researching geothermal applications. There is a higher capital cost (20-30k) but the operating costs are dramatically lower than electric baseboard or fossil fuels.  Plus, geothermal systems provide air conditioning - year round climate control.  The government has talked about bringing back the geothermal grant and if they do, I hope it gets a lot of publicity.  ",
      "User Category": "Industry or Business",
      "Catégorie d'utilisateur": "Industrie ou entreprise",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 2,
      "Date Posted/Dat": "19-Aug-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "In theory tele-working -including telerobotics, streaming micro-gestures and other enhancements on telepresence- can cut emissions from physical commuting, including from small remote communities. That assumes the remote community has sufficient telecommunications bandwidth. So if upgrading power, might want to upgrade telecommunications cabling too.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 3,
      "Date Posted/Dat": "21-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Mandatory public monies investment in energy savings in urban areas",
      "Idea or Comment Description": "In urban areas can there not be a minimum annual monetary investment (based on population) in infrastructure that will support/contribute to energy efficiency?  Think commitment to bicycling, solar, etc.  Would need to be done in a business case style manner such that there is a clear return (including energy return of course) on the investments made.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "User Defined Tags": "Transport; Personal Vehicles; Energy Efficiency; Climate Change",
      "Thème deéfini par l'itilisateur": "Transports; Véhicules personnels; Efficacité énergétique; Chandements climatiques",
      "Forum Related Theme": "Communities; Finance",
      "Thème commun du Forum": "Commuautés; La finance",
      "Idea Score/Évaluations d'idée": 3,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": 1
   },
   {
      "﻿Post Number/ Numéro du poste": 3,
      "Date Posted/Dat": "24-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Thanks for your idea! Could you expand a little bit more on how you think this investment should work and how it would support community energy efficiency? ",
      "Description de l'idée ou Commentaires": "Merci pour votre idée! Pourriez-vous nous en dire un peu plus sur votre vision du déploiement de cet investissement et sur la façon dont il favoriserait l’efficacité énergétique sur le plan communautaire? ",
      "User Category": "Campaign Catalyst",
      "Catégorie d'utilisateur": "Catalyseur de Conversation ",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "Yes/Oui"
   },
   {
      "﻿Post Number/ Numéro du poste": 4,
      "Date Posted/Dat": "21-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Mantra Energy (a Canadian company) the holy grail for a Carbon Neutral World.",
      "Idea or Comment Description": "Mantra's technology, the conversion of CO2 to saleable chemicals (such as formic acid, syngas and others) is one of the few technologies which is business as wellas enviromental friendly. It reduces the cost of energy, it will create jobs and it will provide a carbon neutral environment. Business friendly - with a Tax on Carbon in place and the cost of sequestration of carbon, businesses will be forced to raise it's prices on their products to cover these addition expenditures. By reducing Carbon emissions, Mantra's technology would remove the cost of a Carbon Tax and sequestration, as it would turn a waste product (CO2) to saleable chemicals. This at the same time make the business carbon neutral. This would add revenue to business which in turn would allow them to offer their products at a reduce prices. Economically- business do what business do and pass on their added cost to the end consumer. This in turn takes money out the economy which leads to an economic downturn. Mantra's technology would eliminate those extra expenditures to businesses, thus allowing businesses to charge their customers less for their products. This would free up more expendable capital per individual which would be beneficial for the economy. An addition boost to the economy is that one of Mantra's main by products chemicals is syngas, which can be converted to diesel and home heating fuel. This will drive down the price of both diesel and heating fuel, benefiting businesses and the end consumer thous the over all economy.  Job creations. Mantra's technology takes wasteful CO2 and converts it saleable chemicals. It will create jobs because some one will have to build the units, someone will have to maintain the units, some one will have to sell the chemicals, someone will have to gather the chemicals and some will have to transport the chemicals. Jobs. Cleaner energy future. At the very least Mantra's technology is carbon neutral but it also has the potential to greatly reduce carbon from the environment based on what chemicals it produces. I only state Carbon Neutral because certain chemical produced by Mantra's technology especially syngas (the most valuable one can be converted to diesel fuel) eventually will be burned, while others (example formic acid) takes carbon out of the atmosphere and when used puts none back. Currently Mantra Energy is waiting to hear if it was approved for a grant to bring it technology from lab to market at the CCCI in Vancouver.  ",
      "User Category": "Non-governmental organization (NGO)",
      "Catégorie d'utilisateur": "Organisation non gouvernemental (ONG)",
      "User Defined Tags": "Fossil Fuels; Oil Sands; Innovation; Industry; Clean Tech; Climate Change; Renewables; Environment",
      "Thème deéfini par l'itilisateur": "Combustibles fossiles; Sables bitumineux; Innovation; Industrie; Les technologies propres; Chandements climatiques; Énergies renouvelables; L’environnement",
      "Forum Related Theme": "Innovation",
      "Thème commun du Forum": "Innovation",
      "Idea Score/Évaluations d'idée": 28,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 5,
      "Date Posted/Dat": "24-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Energy east",
      "Idea or Comment Description": "Canada needs to support itself and energy east must be built asap.  Without energy east we are doing more damage to the climate by purchasing dirty oil and making other counties rich instead of our own.  It is a simple concept, support our own first!",
      "User Category": "Industry or Business",
      "Catégorie d'utilisateur": "Industrie ou entreprise",
      "User Defined Tags": "Fossil Fuels",
      "Thème deéfini par l'itilisateur": "Combustibles fossiles",
      "Forum Related Theme": "Pipelines; Petroleum",
      "Thème commun du Forum": "Pipelines; Pétrolier",
      "Idea Score/Évaluations d'idée": 43,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 5,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Social license is not present for this project. Respect social license and do not try to \"manipulate\" the communities in favour of this project.  ",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 5,
      "Date Posted/Dat": "17-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Your distaste for fossil fuels is obvious.  I'm assuming you have completely given up anything associated with or derived from fossil fuels. Like the oil imported into eastern Canada from middle eastern dictatorships.  That would be incompatible with your beliefs I'm sure.  Tell us how you have cleansed your life of the scourge of fossil fuels?  We all want to know.",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 6,
      "Date Posted/Dat": "24-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Moral Authority to Produce Bitumen or Heavy Oil",
      "Idea or Comment Description": "In order to get the bitumen to market through pipelines, the CO2 emissions should be reduced.  The amount of natural gas used to produce the bitumen needs to be decreased significnatly.  And the oil being shipped needs to have less asphaltenes in order to be used in more refineries Deasphalted Alberta Bitumen is the ideal complement to the Light Tight Oil now being produced in the USA. See the attached PDF file.    ",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Forum Related Theme": "Petroleum; Innovation",
      "Thème commun du Forum": "Pétrolier; Innovation",
      "Idea Score/Évaluations d'idée": 17,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 6,
      "Date Posted/Dat": "25-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "North American energy independence!!!!",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 6,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Moral authority and oil production do not go into the same sentence. Look at you children and grand-children in the eyes, and tell them you have the technology, the know-how, but that our generation was too greedy to do something about climate change…trying is not an option, acting is...",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 7,
      "Date Posted/Dat": "24-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Common sense.",
      "Idea or Comment Description": "The argument over whether or not to make breakthroughs in renewable energies is moot, regardless of the climate change debate. Our current energy infrastructure is entirely foundationed in resources that we know are depleting, and will one day be exhausted. The best way to make \"fiscal thinking\" come in line with a sustainable future is to incentivize the fiscal thinkers. Case in point, the CBC's program \"Dragons Den\". The fiscal thinking \"dragons\" turned down an opportunity with an engineer who wanted to build a tidal powered generation station off of the East coast. The only obstacle cited by the dragons was that they would never see return on their investment. They could find no issue, but a monetary issue. In the end they called the engineer crazy, told him that they would love to get drunk with him, but wouldn't give him a plugged nickel. Not a single one of those dragons was able to see that clean, plentiful, sustainable, low environmental impacting energy was something to want to be a part of, because they were afraid of loosing paper and numbers on a computer. No one wants to lose their paper or computer numbers, and that is understandable so it would seem that subsidies are in order. Your next big hurdle comes from Joe working person. They want jobs, and employers want people who are the best for those jobs. This is a main proponent for the old sad story of \"when the mill shut down\" or \"revinew prices tanked\" and those people who depended on the industry. The major concern when these economic events or corrections occur, to the normal person, is that they have been compartmentalized, into a specialized part of the work force. A seamstress likely doesn't know how to smelt metal at the refinery, when the automated pants factory comes to town, and the refinery staff likely don't know how to bake cakes at the bakery, when there is no market call for their skill set. The same is true in the energy sector. By insentivising companies to branch out, you will in kind incentivize the work force that supports that company. For example, if Jane Doe's oil company received some sort of tax break or a levy against them laxxed for funding or investing in clean and renewable energy, eventually Jane's Oil Inc. becomes Jane's Energy and Innovation conglomerative. All of a sudden the share holders of Jane's are working toward more efficient solar panels, and miniaturizing wind mills to prevent bird deaths, MSR nuclear power. Suddenly Bob's copper wire consortium and it's share holders are really interested in microwave energy transmission so that they can have their name on the first orbital solar stations. In turn these companies need staff working and engineering towards the prescribed goals. Incentivize them further, by creating training programs and opportunities for existing staff. Create a business environment where less wire being built means more technicians and engineers are needed, instead of more people destitute because the wire factory shut down. We also need common sense in how we get to an all renewable future. Just because there are solar panels, and electric cars that work in California, doesn't mean that they will work everywhere. WIth the point being that if something is going to work in the future, that is not a reason to stop using what works now. As it stands the \"No more oil keep it in the soil\" mentality leaves a lot of people cold and hungry in the dark. No one through away their bow and arrow when the first musket was introduced, and the same should be expected in the energy sector. Energy is the corner stone of the foundation of modern society. If we take the time and put in the effort to revolutionize energy, society will move with it. If we remove that cornerstone it collapses.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Forum Related Theme": "Renewable; Finance",
      "Thème commun du Forum": "Renewable; La finance",
      "Idea Score/Évaluations d'idée": 10,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 7,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "The future of the planet and its living beings are at stake. Let's act now!",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 8,
      "Date Posted/Dat": "24-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Support Research in Energy Related Sciences + Investment in Evaluative Installations",
      "Idea or Comment Description": "- Ted Sargent at U of T - Bryan Koivisto at Ryerson - Ultracapacitor research at INRS-énergie, Matériaux, Télécommunications, Varennes, QC Swanson's law of photovoltaics suggests that the more gets installed, the cheaper it gets. https://en.wikipedia.org/wiki/Swanson's_law Ultracapacitors and solar panels power the streetlights in Seoul.  Why not here? https://www.youtube.com/watch?v=deXK_qs-f4w  ",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Forum Related Theme": "Renewables; Solar",
      "Thème commun du Forum": "Énergies renouvelables; Solaire",
      "Idea Score/Évaluations d'idée": 16,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 8,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Independent research (not oil and gas) should be subsidized and encouraged. This is an investment!",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 8,
      "Date Posted/Dat": "30-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Fundamental research is critical to generating knowledge - the longest term resource in any innovation based economy.  In the transition to a low carbon world, countries that develop (and protect and use) the knowledge, materials, technologies, and turn-key solutions to the energy system of tomorrow will enjoy the economic benefits that steel, oil and gas, and coal giants did in the past century.  Time to make this happen!",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 8,
      "Date Posted/Dat": "01-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "I have tried to generate interest from several levels of our government with respect to grass roots funding for an energy project. It seems that funding is available, providing that you will commit to investing $750,000.00 yourself in the project. Otherwise, there are a lot of deaf ears being paid as \"public servants\". This is extremely frustrating as I have designed a wave energy system that makes sense. I am sure that there are many shelved ideas that should be given a chance and to be explored.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 9,
      "Date Posted/Dat": "25-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Hemp biomass and fuel",
      "Idea or Comment Description": "Encourage hemp production for seed oil (renewable fuel, biodegradable plastics) and biomass (carbon sequestration).  Waste products include food, fibre and pulp from which other industries can be developed, contributing to economic growth.",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "User Defined Tags": "Fossil Fuels; Biomass; Bioenergy; Climate Change; Renewables; Environment",
      "Thème deéfini par l'itilisateur": "Combustibles fossiles; Biomasse; Bioénergie; Chandements climatiques; Énergies renouvelables; L’environnement",
      "Forum Related Theme": "Renewables; Biomass",
      "Thème commun du Forum": "Énergies renouvelables; Biomasse",
      "Idea Score/Évaluations d'idée": 11,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": 1
   },
   {
      "﻿Post Number/ Numéro du poste": 9,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Hemp and biomass production should be part of the renewable energy sources.   ",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 9,
      "Date Posted/Dat": "01-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "these are no starters. Reduce demand an move to wind wave solar power.",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 9,
      "Date Posted/Dat": "24-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Thanks for your suggestion! Canada has a program for renewable fuels called the ecoENERGY for Biofuels program. You can find more information on our website here.",
      "Description de l'idée ou Commentaires": "Merci pour votre suggestion! Le Canada offre un programme pour les carburants renouvelables appelé le programme écoÉNERGIE pour les biocarburants. Pour en apprendre davantage, visitez notre site Web ici.",
      "User Category": "Campaign Catalyst",
      "Catégorie d'utilisateur": "Catalyseur de Conversation ",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "Yes/Oui"
   },
   {
      "﻿Post Number/ Numéro du poste": 10,
      "Date Posted/Dat": "25-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Support Canadian Energy Independence",
      "Idea or Comment Description": "Support initiatives that help Canada become energy independent. It is damaging to our economy to send tens of billions of dollars to foreign countries each year. It is also distressing given these other counties have very poor human rights standards as well as lower environmental innovation and regulations.",
      "User Category": "Industry or Business",
      "Catégorie d'utilisateur": "Industrie ou entreprise",
      "Forum Related Theme": "International; Security",
      "Thème commun du Forum": "Internationale; Sûreté",
      "Idea Score/Évaluations d'idée": 28,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 10,
      "Date Posted/Dat": "26-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "talking about utter idiocrasy...we have all these natural resources here and this gov't would rather send money to countries that have poor human rights standards!!!",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 10,
      "Date Posted/Dat": "28-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "By supporting our local economy, we can also help reduce the energy needed to transport the resource to us.",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 10,
      "Date Posted/Dat": "17-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Build Energy East!",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 11,
      "Date Posted/Dat": "26-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Utilize what we have now to further our future",
      "Idea or Comment Description": "I would like to see further support for our existing energy sectors. Our oil and gas industry leads the world in technology, safety, environmental policy/protection and ethical work place standards. We should capitalize on our world leading capabilities, and market our selves to the global community as the first class choice when it comes to energy extraction, production and supply. We could then use that unsurpassed advantage to generate revenue and growth with in our country. This would allow us to then have the funds to invest in future energy resources (green energy) and ensure we have a reliable and cost effective alternative when it is required, and allow for a smooth transition.",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Forum Related Theme": "Petroleum; International; Finance",
      "Thème commun du Forum": "Pétrolier; Internationale; La finance",
      "Idea Score/Évaluations d'idée": 20,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 11,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "The new economic growth is in renewable energy…let's stop thinking the old way!",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": 2,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 12,
      "Date Posted/Dat": "26-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Home Automation to Improve Energy Efficiency",
      "Idea or Comment Description": "Home automation in a growing trend that needs to reach more homes in Canada because of its ability to significantly reduce energy use. With Smart learning thermostats and other home automation technologies devices such as motion sensors, smart vents and smart shades, our homes can literally turn off the lights, or close the vents, or open the shades, or turn down the air conditioning for us. Research shows that this smart gear can reduce 20 percent of a home’s energy consumption with little or no behavioral changes. Lets work to bring the cost of these technologies down and more easily accessible to consumers. Why not consider government incentives or rebates to encourage consumer uptake.",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "Forum Related Theme": "Energy Efficiency; Communities",
      "Thème commun du Forum": "Efficacité énergétique; Commuautés",
      "Idea Score/Évaluations d'idée": 2,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 12,
      "Date Posted/Dat": "26-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "That is very expensive and government should have nothing to do with it. ",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 12,
      "Date Posted/Dat": "26-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "gov't has to realize that until they get their spending under control and stop taxing us to death that we feel that the more we try to help the more the gov't takes our hard earned money away!!!  The harder we work the more money trudeau sends away to other countries instead of helping Canadians...in my opinion, with trudeau it's the world and UN first and Canada is in the bottom of the list...and I'm not the only one knowing what's really going on!!!",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 12,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Time to work with the provinces to change the building code (\"a green-sustainable code\"). Let's implement!",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "26-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Passive/no net energy houses appear to be a very good solution",
      "Idea or Comment Description": "If Canada is using 2/3 of it's energy to heat and cool our homes (as the Energy Quiz says) then it seems fairly obvious that we need ensure all our new housing stock is built to the passive/no net energy standard and as much as is possible the existing stock is renovated to reduce their energy demands as much as is possible.",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Forum Related Theme": "Efficiency; Heating",
      "Thème commun du Forum": "Efficiency; Le chauffage ",
      "Idea Score/Évaluations d'idée": 51,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Excellent suggestion.  European countries such as Finland, Sweden, Germany and Austria have been doing this for a long already and have proven the sustainability and economics of this approach which is clearly a progressive move forward. Canadian provinces, with our abundant forest resources, need not invent the wheel but simply adopt similar practises to these European passive house standard leaders.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": 2,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "We know what to do. The only link missing is the \"political will\" People are ready for a transition from non-renewable to renewal energy. ",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "28-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "The sooner we take action on changing building codes, we can allow more time for builders to adjust and have new homes have a smaller footprint. It's easier to build net zero homes from the ground rather than changing later",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "28-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Excellent thoughts; we need a paradigm shift of the people. Codes & standards have historically been built around fixing problems such as failures/collapses/fires so are inherently designed as safety codes although its good to see we now have energy codes gaining traction. i would coin the \"smaller footprint\" as a \"smart footprint\" so regardless of size, use, or occupancy; we design, build, and operate with least draw on resources and put-back. Why can we not give back to the planet? ie: we can look at oil sands as dirty oil or we can look at oil sands as the largest oil clean up ever (we are taking oil out of the surface sand and soil, reducing the natural leaching of hydrocarbons in watershed, and putting back cleaned product including planting; we just need to do the process smarter) I encourage and support the vision. Collectively we take small steps; in the same direction. On the passive front, we reduced our electrical consumption by over 20% by moving to LED.",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "30-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "but the old question who is paying for this?  Is it worth the 20 to 40% uplift in the price? The science and the practice make sense to me but our present political system is not designed to aid up in this, it is designed to tax us for trying to do this, which is counter productive.  we need to move more toward using our resources smarter and more completely than we are at present.  Wind and solar tech have not developed to a point that they really should be considered for main stream power based on relibilty issues ,cost, carbon foot print and alot more.  We can not continue to subsidize these tech just for the feel good effect, it is harming our population! ",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "09-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Good discussion on an important topic. A reminder: From a 2012 Globe and Mail article: \"In 1975, the average size of a house in Canada was 1,050 square feet. Fast forward to 2010 and new homes being built almost doubled to an average of 1,950 square feet. This increase in house size is accompanied by a decrease in the average number of people living in a household. In 1971, it was 3.5; by 2006, that number fell by a full person to 2.5.\" How many square feet do we really need? How many empty rooms are heated and cooled across the nation?  ",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "11-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Thanks for your idea! Did you know that Natural Resources Canada is working with our partners and communities across Canada to demonstrate how energy efficient homes and buildings can be? For example, Drake Landing Solar Community, has used solar energy to fulfill 90% of each home’s heating requirements in their community. You can find more examples and information on our page here.   Thanks again for contributing!   ",
      "User Category": "Youth ",
      "Total \"Likes\"/Totale de « J'aime »": 2,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "26-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "There is a huge prize in energy efficiency, but Ronald Middleton is correct that the gains come at a cost.  I think the government can help push energy efficiency in 2 key ways: Education and incentives.  A lot of efficiency gains can be made at no / low cost.  For example, changing your light bulbs to LEDs and upgrading the insulation in your attic are improvements that will pay for themselves.  As people's knowledge of these types of efficiency improvements increases, they will be more willing to implement them.  The government could lead a campaign to make Canadians more aware of the efficiency options available to them. Of course, even with knowledge, up front cost can still be a barrier.  Government should increase their incentive programs for energy efficiency improvements and make sure people are aware of them.  I think this would be a great way to spend some of the carbon tax money being collected.",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "13-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "passive heating is the way to go. ignore the comments telling you it will cost too muc/take too long/require too much effort. if the governments (provincial included) developed certain insulation standards such as R2000 as law, then developers would be forced to stop making shitty houses",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 13,
      "Date Posted/Dat": "13-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Re passive building costs; the passive tech costs are going down while building codes are becoming more stringent increasing those costs so the costs are converging. The generally accepted dates for all building regs to get to passive is 2030. Our challenge is to get that date accelerated. FYI I am attaching the link to NRCAN is working on passive building technology now http://www.nrcan.gc.ca/sites/www.nrcan.gc.ca/files/emmc/pdf/Building_Smart_en.pdf  Also Passive House Canada has lots of information.",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 14,
      "Date Posted/Dat": "26-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Support Alberta Oil!",
      "Idea or Comment Description": "Alberta oil is some of the cleanest in the world to produce. Our own oil and gas companies actually care about the environment that they live in and lead the industry in emissions standards. They also invest millions into keeping our air clean. Canada needs to support and use our own oil and gas before shipping it in from countries with abysmal records. Cheaper, cleaner, and more ethical. ",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Forum Related Theme": "Petroleum",
      "Thème commun du Forum": "Pétrolier",
      "Idea Score/Évaluations d'idée": 43,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 14,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Stop subsidies to oil and gas compagnies. The time for transition is now. We got out of the Stone Age not because we ran out of rocks, it was because we found something new and better. We found the \"new and better\", time for action.  ",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": 3,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 14,
      "Date Posted/Dat": "30-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "we need to support our own country, not the Mideast or other exporting countries.  Why do the voter of Quebec and Ontario want to pay up to 20 cents a liter more for fuel than what would be if it came from the west.  What is not well known is that to refine our oil in Quebec and Ontario, the oil companies need to build delayed Cokers, this would provide 2 to 4 years of work and would provide employment for up to 500 workers.  It is a win all the way around.",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": 2,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 14,
      "Date Posted/Dat": "13-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Alberta oil is not clean, in fact it's more energy intensive than most other types of oil, hence why it's considered unconventional. I love Canada, but I refuse to accept that we need to burn fossils for fuel. We've got much more long-term potential in renewables all over the country, that's what the future will look like.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 14,
      "Date Posted/Dat": "17-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "I'm assuming that [previous commenters] have taken a vow of fossil fuel poverty and do not use any hydrocarbon based products in their daily lives. ",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 14,
      "Date Posted/Dat": "18-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Yup ...let's all freeze in the dark ?",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 15,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Smart Support for Renewables",
      "Idea or Comment Description": "Governments should give us more control over our electricity system and stop overspending on subsidies. With solar and wind becoming so cheap, people should be able to purchase their own energy supply and provide a small amount of power back to the grid for free to pay for infrastructure connections. Electricity needs to be clean, reliable, AND affordable. We also need to invest in electricity storage!",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "User Defined Tags": "Electricity; Storage; Renewables",
      "Thème deéfini par l'itilisateur": "Électricité; Stockage d’énergie; Énergies renouvelables",
      "Forum Related Theme": "Electricity; Storage; Renewables; Affordability; Wind; Solar;",
      "Thème commun du Forum": "Électricité; Stockage d’énergie; Énergies renouvelables; Abordabilité; Éolienne; Solaire;",
      "Idea Score/Évaluations d'idée": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 16,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Continue Support for Home Energy Retrofits & Remove Disincentives",
      "Idea or Comment Description": "The home energy retrofit program needs to be reinstated/expanded .  Furthermore, and in Ontario specifically, Global Adjustment charges prove to be a disincentive against saving energy, because it further increases the gap between demand and available generation capacity.  We are paying power plants to sit and do nothing and this cost falls back on our energy bills.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "User Defined Tags": "Electricity; Energy Efficiency",
      "Thème deéfini par l'itilisateur": "Électricité; Efficacité énergétique",
      "Forum Related Theme": "Efficiency",
      "Thème commun du Forum": "Efficiency",
      "Idea Score/Évaluations d'idée": 5,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 17,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Increase urban green space",
      "Idea or Comment Description": "City planners of the future will need to re-think their designs. Currently, Canadian cities' are ruled by cars, which contributes to 23% of our GHG emissions. Cities' should be designed for the people, for pedestrians, bikers and possess a community feel - become more \"liveable\". Increasing urban green space, such as parks, will be needed. In addition, urban green space has a great impact on our health (more space of physical activity) and the environment (filters pollutants). More walkable routes will decrease our need for owning cads.  There's no doubt that cities of the future will continue to grow. Space will become a clear issue. We can't keep planning our city based on the need for more public parking space. Urban planners have an opportunity to restructure it to include more pedestrian only streets, expand public transportation, and slowly change people's mindset and habits on how a modern city should function.  Canada is vast, there's no denying that. Changing how we move won't be easy, but we should start thinking about updating our perception of our future infrastructure needs.",
      "User Defined Tags": "Transport; Personal Vehicles; Buildings; Climate Change",
      "Thème deéfini par l'itilisateur": "Transports; Véhicules personnels; Bâtiments; Chandements climatiques",
      "Forum Related Theme": "Communities; Transportation",
      "Thème commun du Forum": "Commuautés; Transports",
      "Idea Score/Évaluations d'idée": 4,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 18,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Mix energy sources",
      "Idea or Comment Description": "We could use a mix of renewable energy sources (e.g. wind, biomass, wave, solar, etc) to supply our energy",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Forum Related Theme": "Renewables",
      "Thème commun du Forum": "Énergies renouvelables",
      "Idea Score/Évaluations d'idée": 5,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": 1
   },
   {
      "﻿Post Number/ Numéro du poste": 18,
      "Date Posted/Dat": "28-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Renewable or potentially perpetual energy sources such as wind/solar and others not as prevalent such as leveraging planet rotation should be explored; but with caution. The caution example is geothermal wherein drawing heat from the earth's upper crust may have other unintended impacts ie: geothermal capture in some parts of the world has caused mud pools, geysers to slow/stop thereby changing the risk of future eruptions; some wind capture turbines have been noted as having high number of bat fatalities.",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 18,
      "Date Posted/Dat": "01-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Wave energy is overlooked in our race towards clean energy. Calculations on the potential are staggering. There are millions of tons of rising and falling water in a very small area, and wave action is unrelenting. For those who are familiar with the Limpet and Mutriku wave energy converters (electricity generators), these systems rely on a \"blowhole\" design where air captured from a wave is blown through a turbine on a rising wave and then reverses the airflow as the wave drops. Generators maintain the same direction of rotation via an inefficient Wells turbine blade. I have developed a system that will improve upon those systems on several levels, including: applying both vacuum and air pressures simultaneously to an efficient turbine blade design, generators can be located away from damaging elements, generator rpm is continuous and energy output adjusts automatically with wave heights. I just need the right people to listen.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 18,
      "Date Posted/Dat": "24-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Thanks for your suggestion! Canada has a Clean Energy Fund program that works to ensure a healthy environment and supports clean energy research. You can find more information here. One of the projects that you might find interesting is the West Coast Wave Initiative (WCWI) by the University of Victoria, created to study the energy we can collect from waves in Canadian waters. More information can be found on their project page. ",
      "Description de l'idée ou Commentaires": "Merci pour votre suggestion! Le Canada dispose également du programme du Fonds pour l’énergie propre qui vise à assurer un environnement sain et à appuyer la recherche sur l’énergie propre. Pour en apprendre davantage, veuillez cliquer ici. L’un des projets que vous pourriez trouver intéressants est l'Initiative relative à l'énergie des vagues de la côte ouest (West Coast Wave Initiative – WCWI) de l’Université de Victoria, créée pour étudier l’énergie que nous pouvons tirer des vagues des eaux canadiennes. Des renseignements supplémentaires sont disponibles sur la page du projet. ",
      "User Category": "Campaign Catalyst",
      "Catégorie d'utilisateur": "Catalyseur de Conversation ",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "Yes/Oui"
   },
   {
      "﻿Post Number/ Numéro du poste": 19,
      "Date Posted/Dat": "27-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Invest in the energy sector that's already established ",
      "Idea or Comment Description": "1. Build pipelines. Without a good pipeline infrastructure we lose on two fronts a.) royalty revenues lost from the heavily discounted crude that we sell to the USA, we could be getting market prices for our resources. b.) paying out higher prices for imported oil that we don't need to import because we have it here already. On the social aspect we are also helping to support countries that have terrible human rights and worker safety practices. Building pipelines will also cut down the carbon footprint required to transport our crude and create good paying jobs all across the country.  2. Alberta energy industry was created with the Hep of public funds. So why should we not pair the energy industry's with our governments again. Our refineries are old and or not feasible to start again. They are too costly for any one company or multiple companies to invest in building as the ROA is too far down the line. However with the knowledge and expertise of the energy industries and the backing of government support a great partnership could be built with building new modern energy efficient refineries. All of these can be places in several places across Canada from North to south, east, central and west. Large quantities of skilled jobs would be created, from academia, science and technology, trades and labourers. The tax revenues from these jobs will fund government and partial profits and or loans from the government to fund these project would also come back. So this case it would be a double dip(so to speak) for the government.   3. Inspire new innovations. Provide energy companies tax insensitives for funding research and development of new cleaner technologies. Energy companies will also make the switch to other forms of energy when the time is right. Help them want to start developing this sooner than later. More funding for research and development will help ideas become realities.    Canada has done a lot a lot of things right with our energy sectors. We should take the lead and show the world how this can be done the right way and the most environmentally beneficial way. We really are leaders and innovators here. Much of what has been learned and designed in Canada is now used by our competitors. ",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "User Defined Tags": "Fossil Fuels; Crude Oil; Innovation; Pipelines; Transport; Energy Efficiency; Industry",
      "Thème deéfini par l'itilisateur": "Combustibles fossiles; Pétrole brut; Innovation; Pipelines; Transports; Efficacité énergétique; Industrie",
      "Forum Related Theme": "Pipelines; Petroleum; Natural Gas; International",
      "Thème commun du Forum": "Pipelines; Pétrolier; Gaz Naturel; Internationale",
      "Idea Score/Évaluations d'idée": 73,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 19,
      "Date Posted/Dat": "30-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Vey true we have to stop exporting our brains and ideas and start using them at home.  We as a whole are one of the most innovative societies on eath, but we keep being shoved into the shadows of the Americans, we need to step into the light.",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 19,
      "Date Posted/Dat": "17-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Great points. I think the Canadian oil & gas industry has become incredibly politicized, particularly in recent years with the debate over Keystone XL and oilsands production. This is unfortunate because it obscures the fact that, as you mentioned, Canada's energy industry has some of the highest environmental and ethical standards in the world. We do ourselves a great disservice by holding back our natural gas and conventional oil producers from reaching their full potential in the name of climate goals. All we ultimately achieve by doing so is allowing other countries (many of which are dictatorships with terrible human rights records) to sell more of their sizeable oil & gas reserves into the global market. We ultimately end up with the same amount of global carbon emissions and negative effects on our climate, but have funded authoritarian governments in the process rather than investing in our own society here at home.",
      "User Category": "Industry or Business",
      "Catégorie d'utilisateur": "Industrie ou entreprise",
      "Total \"Likes\"/Totale de « J'aime »": 2,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 19,
      "Date Posted/Dat": "20-Jul-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Can't disagree more with this. Every time I hear that we're building more pipelines, I can't help but think how useless they'll be in 5-10 years. You don't have to be a business analyst to see that oil will not be worth extracting via the most expensive method (tar sands) in the coming decade.    Climate change is real. My children need to live in a world that isn't a complete mess. ",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 19,
      "Date Posted/Dat": "15-Jul-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Some great points here but I mostly disagree. I think we are already dangerously over invested in oil and gas infrastructure. The future low-carbon energy systems are coming much faster than many think. For example some predict a transformation of the automobile industry with self-driving electric vehicles providing transportation as a service by 2030. Solar and wind energy costs keep dropping. Saudi Arabia is investing in solar. Fossil fuels are finite and climate change is real. More pipe-lines and refinery capacity is a dead end leaving our kids with stranded assets and a climate catastrophe.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": 2,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 19,
      "Date Posted/Dat": "13-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "I completely disagree with this idea as well. It provides no help for reducing our carbon emissions and would definitely do the opposite, pushing us further down the path of climate change and global warming. I don't think enraging other nations by not following through on our global climate agreements is a good idea either. Please see the global reaction to US & Trump leaving Paris Agreement.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 19,
      "Date Posted/Dat": "27-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Love it! Great idea!",
      "User Category": "Industry or Business",
      "Catégorie d'utilisateur": "Industrie ou entreprise",
      "Total \"Likes\"/Totale de « J'aime »": 3,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 19,
      "Date Posted/Dat": "27-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "I agree. GHG is a global issue. No matter what we do in Canada, it will have no measurable impact on global climate. Sad but true. Canada already absorbs 20-30% more carbon than we emit.  Exporting our vast oil reserves to the global market will generate funds needed so that our tiny and environmentally conscious country can realize all of the environmentally friendly ideas we have. Interesting to note that there are 600,000,000 people currently living in India without electricity. When they can afford it, will their first car be electric?  Nope. Their cars will run on petroleum and their electricity will come from coal. Any action we take locally in Canada will sadly be offset by several orders of magnitude by India/China/US/EU. If Canada is to make any difference at all, globally, we must be focus on helping developing countries, say, by exporting liquid natural gas to offset India's future massive increase in coal use. These countries will dictate our future.",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": 3,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 19,
      "Date Posted/Dat": "29-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Oil and hundreds of petroleum products will be used for many decades to come.",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Total \"Likes\"/Totale de « J'aime »": 2,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 19,
      "Date Posted/Dat": "28-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "We need to use new pipeline technology instead of the 50 plus year old rotting ones we have. that is why we are having the leaks, they  ( the pipelines from 50 years ago) are breaking down. There is new technology that we can use to insure that leaks do not happen and it will buy us some time to convert over to green energy. Right now trains on railways older than 50 years and often in disrepair, are carrying the crude through our cities,countryside and small towns, derailments are more common than pipeline leaks. Trucks haul crude through our country as well, are all those trucks in good working order? no issues with loose wheels, worn brakes or poor upkeep? Now I'm not saying that this is all the time, but it happens more than we think. We need to buy some time to convert over to green energy and technology and it is preferable to use updated smart pipelines to do it rather than rely on 50 year old aging technology that has issues. ",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": 2,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 20,
      "Date Posted/Dat": "28-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Better Decisions",
      "Idea or Comment Description": "In the business world the number 1 Priority is money, and fear.  There are many opportunities to reduce or eliminate our energy consumption today.  Most people in business are choosing to maintain status quo rather than taking a risk or thinking out of the box.  ",
      "User Category": "Industry or Business",
      "Catégorie d'utilisateur": "Industrie ou entreprise",
      "Forum Related Theme": "Efficiency",
      "Thème commun du Forum": "Efficiency",
      "Idea Score/Évaluations d'idée": 6,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 21,
      "Date Posted/Dat": "29-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Urban Planning and Building Codes",
      "Idea or Comment Description": "Most of our ridiculously high personal energy consumption is a result of dysfunctional urban planning and development caused by corrupt and incompetent political systems. As a result we have millions of younger people who can only afford to live in clusters of massive ugly glass fishbowl condos with horrible energy efficiency in areas with no employment, poor local shopping, and that have no hope of being connected to effective transportation. And on the other hand we have millions of baby boomers and older who own inefficient detached houses that until recently were powered by cheap electricity paid for with massive government borrowing (hydro/nuclear) and smog belching coal plants, but who now cannot afford to pay their bills and want young taxpayers to pay for subsidies and renovations so they can afford to stay in their million dollar houses and collect pensions that younger people will never get....but I digress... The only meaningful and continuous improvements in energy consumption, local employment and quality of life will need to come from effective political structures that support intelligent planning and coordinated development (by world class planners/engineers...not some quick buck developers and political hacks!) of public transit and density, including staged expropriations of low density housing and business along current and planned transit corridors.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Forum Related Theme": "Communities; Efficiency; Electricity; Labour Markets",
      "Thème commun du Forum": "Commuautés; Efficiency; Électricité; Marché du travail",
      "Idea Score/Évaluations d'idée": 19,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 21,
      "Date Posted/Dat": "30-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "The smart city wins are well known.  Look to the studies done in the UK, what Scandinavia already does, and the work of the Federation of Canadian Municipalities (I don't work with them, promise).  It's all about votes, and in parallel - time and money.  How do we convince a city, province, and country to double down for the long term?  ... to overcome the possibility of a slight lost benefit from, for example, a better highway to the suburbs tomorrow - in exchange for greater energy efficiency, walkability, and greener spaces, for those in a high population density area?  How do we overcome political sales pitches of short term, damaging, slashes to energy bills... in favor of a long term vision for a greener, more efficient, more equitable system that integrates big data, transit needs, energy use, and neighborhood design that may add $100 to your annual bill for a few years?",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 21,
      "Date Posted/Dat": "01-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Improved codes and plan requirements for all new construction to be be net zero by 2035-40 and provide generous rebates for existing buildings and homes to become net zero or near net zero by 2035-40",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 22,
      "Date Posted/Dat": "29-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "High Altitude Wind Power",
      "Idea or Comment Description": "Im not an expert, but high altitude wind power seems like an interesting next generation non-emitting energy technology that could have some interesting applications across Canada. Im sure there are a number of technical hurdles to overcome, but looking out over the course of a generation I could see this as a potential energy source we rely on in paricular areas across Canada such as rural and remote communities and off-grid industries. Here's an intersting video and lots more examples on YouTube. https://m.youtube.com/watch?v=kldA4nWANA8",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "User Defined Tags": "Wind",
      "Thème deéfini par l'itilisateur": "Éolienne",
      "Forum Related Theme": "Renewables; Wind; Innovation",
      "Thème commun du Forum": "Énergies renouvelables; Éolienne; Innovation",
      "Idea Score/Évaluations d'idée": 3,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 22,
      "Date Posted/Dat": "30-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "I agree it's a cool idea.  Challenges - yes.  Other cheaper, more readily deployable, easier, equally non-emitting options - also yes.  Definitely doesn't mean we shouldn't pass by investigating longer term concepts, however.  Maybe, for example, the control systems designed will have other more short term wins - possibly controlling kites to pull cargo ships?  Investigative R&D where we have domestic expertise is a strong investment.",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 23,
      "Date Posted/Dat": "29-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Infrastructure Improvement Grants/ Loans",
      "Idea or Comment Description": "Establish an extensive, flexible incentive system to promote the adoption of new technologies that do more for less, for longer.  Electric (or non-fossil-fuel) transportation Solar/ wind/ hydro/ etc. electricity generation Manufacturing improvements Etc. This strategy has a high-cost short term, but a major infrastructure improvement over long-term. This would create jobs and bolster momentum towards achieving climate and energy goals. #ElonMusk",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "User Defined Tags": "Solar; Innovation; Transport; Electricity; Heating/cooling; Energy Efficiency; Retrofit; Net-zero; Homes; Clean Tech; Climate Change; Renewables; Environment",
      "Thème deéfini par l'itilisateur": "Solaire; Innovation; Transports; Électricité; Le chauffage et le refroidissement; Efficacité énergétique; Retrofit; Nette zéro ; Maisons; Les technologies propres; Chandements climatiques; Énergies renouvelables; L’environnement",
      "Forum Related Theme": "Electricity; Renewables; Finance",
      "Thème commun du Forum": "Électricité; Énergies renouvelables; La finance",
      "Idea Score/Évaluations d'idée": 14,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 23,
      "Date Posted/Dat": "30-Apr-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "So many programs at different levels of government working towards this end... but when competing with the overwhelming established status-quo, I agree with you.. seems there needs to be so much more to make the best of the amazing technology options already available for massive scale-up. Wouldn't it be nice if some sufficiently strong economic instrument were able to level the playing field and incentivize the best performing options at the same time?  Will carbon pricing, with the current plan to slowly increase, do just this?  Seems so hard to say.",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 23,
      "Date Posted/Dat": "06-Oct-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "What the government gives to one person they must first steal from another",
      "User Category": "Member of an Indigenous organization",
      "Catégorie d'utilisateur": "Membre d’organization Autochtone",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 24,
      "Date Posted/Dat": "01-May-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Clean Energy in the North",
      "Idea or Comment Description": "Many Northern communities across Canada are struggling with dirty, high-cost diesel power systems. By 2050, these communities should be transitioned to a mixture of renewable baseload and variable energy. To get there we need to scale up prototype testing now - to install clean energy (with biomass, solar, wind, combined heat and power, efficiency) as old infrastructure starts to be decommissioned.  Canada can not only improve environmental and social outcomes for Canadians, but create new industries for cold-energy technologies and market them to Russia, Europe, America, etc. ",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "User Defined Tags": "Wind; Solar; Storage; Renewables",
      "Thème deéfini par l'itilisateur": "Éolienne; Solaire; Stockage d’énergie; Énergies renouvelables",
      "Forum Related Theme": "Renewables; Remote Communities; Innovation",
      "Thème commun du Forum": "Énergies renouvelables; Les collectivités éloignées; Innovation",
      "Idea Score/Évaluations d'idée": 41,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 24,
      "Date Posted/Dat": "09-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "I would love to see a cost comparison between the status quo (diesel fired power) vs a mix of renewables plus batteries.  Has anyone come across such studies?",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": 1,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 24,
      "Date Posted/Dat": "29-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "How about \"enhanced geothermal\"?  This system uses the same hydraulic fracturing technology as used in the oil and gas industries, but rather than looking for oil you are interested in the heat from the rocks.  At a depth of 2000 - 5000 meters the rock is hot enough to generate steam for a renewable energy power plant.  The best part with geothermal power is that it is consistent and dispatchable (i.e. baseload power).  ",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 24,
      "Date Posted/Dat": "22-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Cost comparisons? Well, they are currently using diesel. That usually means its cheaper or better suited than any of the other methods. Its likely people don't worry that it is dirty when they need power when its -45C.    ",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 25,
      "Date Posted/Dat": "01-May-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "INVEST IN ENERGY STORAGE SYSTEMS",
      "Idea or Comment Description": "The federal and provincial governments should invest in and encourage private investment in the research and development of large-scale energy storage systems to be used in conjunction with wind and solar energy generation systems.  This will further reduce our need for nuclear and carbon-emitting energy sources.",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "User Defined Tags": "Fossil Fuels; Natural Gas; Wind; Solar; Nuclear; Innovation; Electricity; Power; Clean Tech; Climate Change; Storage; Environment",
      "Thème deéfini par l'itilisateur": "Combustibles fossiles; Gaz Naturel; Éolienne; Solaire; Énergie Nucléaire; Innovation; Électricité; L'électricité; Les technologies propres; Chandements climatiques; Stockage d’énergie; L’environnement",
      "Forum Related Theme": "Innovation; Electricity; Storage; Renewables; Nuclear",
      "Thème commun du Forum": "Innovation; Électricité; Stockage d’énergie; Énergies renouvelables; Énergie Nucléaire",
      "Idea Score/Évaluations d'idée": 60,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 25,
      "Date Posted/Dat": "02-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Absolutely - and not just storage for a few hours.  In remote communities we need storage that will last for months.",
      "User Category": "Employed in the energy industry",
      "Catégorie d'utilisateur": "Les personnes employee par l’industrie énergie",
      "Total \"Likes\"/Totale de « J'aime »": 2,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 25,
      "Date Posted/Dat": "09-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Indeed, energy storage is a valuable asset in any sustainable energy system. For many parts of Canada, a possible alternative to storage could be better integration of provincial electricity networks. For example: if wind stops blowing in Ontario, instead of firing up the gas power plants or using expensive storage, you could import cheap hydro electricity from Quebec. A snippet from Clean Energy Canada 2016 Tracking The Energy Revolution report (page 16): \"In Canada, electricity systems are largely the domain of individual provinces. Cooperation between the provinces on power production and transmission has proven tricky political terrain to navigate.\" The report highlights some of the recent milestones towards greater electricity system integration. ",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": 4,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 25,
      "Date Posted/Dat": "29-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "In the prairie Provinces roughly half of GHG emissions in the buildings sector (both residential and commercial/institutional) comes from heating alone.  We have long, cold winters, and we rely on natural gas for heating.  However, we also have an incredible solar resource in the summer.  Seasonal energy storage using solar thermal in a community-scale system has been demonstrated in Okotoks, Alberta, in a subdivision called Drake Landing ( https://www.dlsc.ca/ ).  Last year the community met 100% of their heating needs using solar heat stored in the ground in a borehole field.  I think this type of smart energy community could go a long way to reducing Canada's GHG emissions.  I wonder if we could also view the winter cold as a resource to store for use in the hot summer?  ",
      "User Category": "Government",
      "Catégorie d'utilisateur": "Gouvernement",
      "Total \"Likes\"/Totale de « J'aime »": 4,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 25,
      "Date Posted/Dat": "22-Aug-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "\"I wonder if we could also view the winter cold as a resource to store for use in the hot summer?\" --from the comment above I read from a few sources (you can Google it for yourself too) that people actually used to do just that: they would cut blocks of ice from waterways, cover them in hay or sawdust, and store the blocks in big buildings for use in the summer. I don't know if that's the best modern-day solution, but it's an interesting starting point.",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 25,
      "Date Posted/Dat": "16-Sep-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "We have a great deal of storage capacity in the form of hydro dams.   But further grid stiffening in the form of large-scale batteries does make sense.  ",
      "User Category": "Industry or Business",
      "Catégorie d'utilisateur": "Industrie ou entreprise",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 26,
      "Date Posted/Dat": "01-May-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Reduce consumption",
      "Idea or Comment Description": "NS has an efficiency cooperation operating under the utility review broad to support reduction in energy use. It recognizes that reduced consumption is the least expensive way to achieve GHG reductions and other benefits.    ",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "User Defined Tags": "Energy Efficiency",
      "Thème deéfini par l'itilisateur": "Efficacité énergétique",
      "Forum Related Theme": "Efficiency",
      "Thème commun du Forum": "Efficiency",
      "Idea Score/Évaluations d'idée": 20,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 26,
      "Date Posted/Dat": "02-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Reduced consumption is easier in some areas of the country than it is in others.  Are you suggesting that we all move to Vancouver and Vancouver Island so that we can turn off our natural gas and furnace fans 9 months of the year?  ",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 26,
      "Date Posted/Dat": "03-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Every degree we turn down the temperature while we heat our homes and turn up the temperature on the air conditioner, people can help reduce consumption. Further, by insulation and strategic planning, the need for heat could be reduced.",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 26,
      "Date Posted/Dat": "09-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "We often talk about daily recurring consumption reduction efforts: reducing the thermostat by one or two degrees, turning off the lights as you exit a room, or shutting down the computer when leaving the office. All of these small actions add up and should certainly be encouraged.  But there are also notable rare moments in everyone's life that have a disproportionate impact on their energy consumption. For example: when you buy a property. If you decide to buy a 2,500 square foot house outside of town instead of a 1,000 square foot apartment accessible by public transportation, your energy consumption will be drastically higher for years to follow. Another example is when you buy a car: all of those SUVs people are buying instead of more compact vehicles...  Reducing energy consumption by turning down the thermostat a degree or two in a home that is mostly unoccupied... Let's not miss the forest from the trees. Thoughts? ",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 26,
      "Date Posted/Dat": "11-Oct-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Reducing consumption does not follow the average Canadian's habits. Also, it does not maintain the Canadian tax base (property tax), nor our consumption and GDP levels that we currently see. Policies that encourage this are hard to implement as they may require governments to downsize.",
      "User Category": "Academia or education",
      "Catégorie d'utilisateur": "Académie ou éducation",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "No/Non"
   },
   {
      "﻿Post Number/ Numéro du poste": 27,
      "Date Posted/Dat": "01-May-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "WAVE ENERGY OVERLOOKED, BRING JOBS AND INDEPENDANCE TO ISOLATED COMMUNITIES.",
      "Idea or Comment Description": "Why is wave energy overlooked? It is likely the most consistent available resource on the planet. Every new breakwater project should be built with my Wavekiss system integrated into it's construction. Not only will my system generate electricity on land, it has the potential to supplement the propulsion and electricity generation for marine vessels. I estimate that an anchored freighter will potentially produce about 30kw of continuous power in only 4 inch waves. Imagine the savings at sea! I need partners to move forward with my \"patent pending\" system to a \"proof of concept\" level. The Canadian governments are no help at all to a \"grass roots\" inventor like myself. Read the attachment and comment or contact me. ",
      "User Category": "General public",
      "Catégorie d'utilisateur": "Public générale",
      "Forum Related Theme": "Renewables; Tidal; Innovation",
      "Thème commun du Forum": "Énergies renouvelables; Énergie Marémotrice; Innovation",
      "Idea Score/Évaluations d'idée": 9,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "0"
   },
   {
      "﻿Post Number/ Numéro du poste": 28,
      "Date Posted/Dat": "01-May-17",
      "Idea or Comment/Idée ou commentaire": "Idea/Idée",
      "Title": "Fund Academic Research and Partnerships",
      "Idea or Comment Description": "The transition to renewable energy alternatives requires significant innovation and research. Academics need funding to carry out this research. Thus, the government should: -Create incentives for researchers to work on clean energy projects -Provide more funding to clean energy research programs at universities -Support partnerships between academics and industries such that applicable research is conducted",
      "User Category": "Community organization",
      "Catégorie d'utilisateur": "Organization communautés",
      "Forum Related Theme": "Renewables; Innovation",
      "Thème commun du Forum": "Énergies renouvelables; Innovation",
      "Idea Score/Évaluations d'idée": 11,
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": 1
   },
   {
      "﻿Post Number/ Numéro du poste": 28,
      "Date Posted/Dat": "24-May-17",
      "Idea or Comment/Idée ou commentaire": "Comment/Commentaire",
      "Idea or Comment Description": "Thanks for your comment! Natural resources Canada is currently funding a lot of renewable energy demonstration projects to gather information about how best to use renewable energy in the future. You can find more information here. ",
      "Description de l'idée ou Commentaires": "Merci pour votre commentaire! Ressources naturelles Canada finance actuellement de nombreux projets de démonstration d’énergie renouvelable afin de recueillir de l’information sur la meilleure façon d’utiliser cette énergie à l’avenir. Pour en apprendre davantage, veuillez cliquer ici. ",
      "User Category": "Campaign Catalyst",
      "Catégorie d'utilisateur": "Catalyseur de Conversation ",
      "Total \"Likes\"/Totale de « J'aime »": "0",
      "Campaign Catalyst Comment?/ Commentaire du Catalyseur de Conversation?": "Yes/Oui"
   }
]